---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeParameters
source: html/8161950e-3ac7-0f8b-cc9f-2565a2d0afd9.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeParameters

Class containing functions that create and retrieve shared parameters for RebarShapes.

## Syntax (C#)
```csharp
public class RebarShapeParameters : IDisposable
```